app/views/groups/show.html.erb

    <% if !@transactions.blank? %>
      <span><%=@transactions.first.user.username%></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 3]]