app/helpers/transactions_helper.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
---
  def sum_amount(transactions)
    sum=0
    if current_user.transactions
      current_user.transactions.each {|t| sum=sum+t.amount}