app/controllers/groups_controller.rb

  def index
    @groups = Group.all.order(name: 'ASC')
---
SELECT "groups".* FROM "groups" ORDER BY "groups"."name" ASC

  def create
    @group  = current_user.groups.build(group_params)
    if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @group = Group.find_by(id: params[:id])
    @transactions = Transaction.includes(:group, :user).where(group_id: @group.id).order('created_at DESC')
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 3]]