app/controllers/transactions_controller.rb

  def no_grp
    @transaction_nil = current_user.transactions.where(group_id: nil)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."group_id" IS NULL  [["user_id", 1]]

  def index
    @transactions = current_user.transactions.where.not(group_id: nil).order('created_at DESC')
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND NOT (("transactions"."group_id" = $2 OR "transactions"."group_id" IS NULL)) ORDER BY created_at DESC  [["user_id", 1], ["group_id", nil]]

  def show
    @transaction = Transaction.find_by(id: params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def create
    @transaction = current_user.transactions.build(transaction_params)
    if @transaction.save
---
INSERT INTO "transactions" ("name", "amount", "user_id", "created_at", "updated_at", "group_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "jlkkl"], ["amount", "77.0"], ["user_id", 1], ["created_at", "2021-01-29 14:12:09.456437"], ["updated_at", "2021-01-29 14:12:09.456437"], ["group_id", 1]]