app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "tester"], ["created_at", "2021-01-29 21:12:44.475136"], ["updated_at", "2021-01-29 21:12:44.475136"]]
---
  def create
    @user = User.new(user_params)
    if @user.save