app/views/transactions/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    <div class="d-flex">
      <div class="border"><img src="<%=transaction.group.icon%>" alt="" class="w-25 "></div>