app/views/transactions/new.html.erb

SELECT "groups".* FROM "groups"
---
      <div class="form-group w-75 mx-auto">
        <%= collection_select(:transaction, :group_id, Group.all, :id, :name, { :prompt=> 'Group' }, class:
          "form-control my-3  " )%>