app/views/transactions/show.html.erb

<section class=" border   my-2">
    <% if @transaction.group %>
 <div class="d-flex align-items-center align-content-center border py-3">
  <div><img src="<%=@transaction.group.icon%>" alt="" class="w-50 border">
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]